Catalogs/JobQueueDataAreas.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>JobQueueDataAreas</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Use</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ScheduledStartTime</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>JobState</Name>
					<Type>
						<v8:Type>cfg:EnumRef.JobStates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ActiveBackgroundJob</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExclusiveExecution</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Pattern</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.QueueJobsTemplates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TryNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MethodName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Parameters</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LastStartDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CompletionDateLastRun</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Key</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RestartIntervalOnFailure</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Schedule</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RestartCountOnFailure</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ExchangeWithSiteScheduledJobs/Ext/Module.bsl
// It creates a job of the job queue.
//
// Parameters
//  NodeCode - String - The NodeName
//  exchange plan node code - String - Schedule exchange
//  plan node name - JobSchedule - Schedule.
//
// Return value: UUID.
//
Function CreateNewJob(NodeCode, NodeName, Schedule) Export
	
	SetPrivilegedMode(True);
	
	Parameters = New Array;
	Parameters.Add(NodeCode);
	
	ScheduledJobID = Undefined;
	
	If Not CommonUseReUse.DataSeparationEnabled() Then
		
		Task = ScheduledJobs.CreateScheduledJob("ExchangeWithSite");
		Task.Use = True;
		Task.Key = String(New UUID);
		Task.Description = NodeName;
		Task.Parameters = Parameters;
		Task.Schedule = Schedule;
		Task.Write();
		
		ScheduledJobID = Task.UUID;
		
	Else
		
		JobParameters = New Structure();
		JobParameters.Insert("Use", True);
		JobParameters.Insert("MethodName" ,Metadata.ScheduledJobs.ExchangeWithSite.MethodName);
		JobParameters.Insert("Parameters" ,Parameters);
		JobParameters.Insert("Schedule",Schedule);
		
		Task = JobQueue.AddJob(JobParameters);
		ScheduledJobID = Task.UUID();
		
	EndIf;
	
	Return ScheduledJobID;
	
EndFunction

// It returns the queue job ID (to save in the infobase data).
//
// Task - CatalogRef.JobQueueDataAreas.
//
// Return value: UUID.
//
Function GetIDTasks(Val Task) Export
	
	SetPrivilegedMode(True);
	Return Task.UUID();
	
EndFunction

// Sets the background job parameters or jobs queue job.
//
// Parameters:
//  Task - CatalogRef.JobQueueDataAreas,
//  Use - Boolean, check box
//  of using the scheduled job, NodeCode - String - The NodeName
//  exchange plan node code - String - Schedule exchange
//  plan node name - ScheduledJobSchedule.
//
Procedure SetJobParameters(Task, Use, NodeCode, NodeName, Schedule) Export
	
	SetPrivilegedMode(True);
	
	Parameters = New Array;
	Parameters.Add(NodeCode);
	
	If TypeOf(Task) = Type("ScheduledJob") Then
		
		Task.Use = True;
		Task.Key = String(New UUID);
		Task.Description = NodeName;
		Task.Parameters = Parameters;
		Task.Schedule = Schedule;
		Task.Write();
		
	Else
		
		If Task = Undefined Then
			Return;
		EndIf;
		
		JobParameters = New Structure();
		JobParameters.Insert("Use", Use);
		JobParameters.Insert("MethodName", Metadata.ScheduledJobs.ExchangeWithSite.MethodName);
		JobParameters.Insert("Parameters", Parameters);
		JobParameters.Insert("Key", Metadata.ScheduledJobs.ExchangeWithSite.Key);
		JobParameters.Insert("Schedule", Schedule);
		
		JobQueue.ChangeTask(Task, JobParameters);
		
	EndIf;
	
EndProcedure

// It returns the job parameters of the job queue.
//
// Parameters:
//  Task - CatalogRef.JobQueueDataAreas.
//
// Return value: Structure, key description - see returned value
//  description for the JobQueue.GetJobs() function.
//
Function GetJobParameters(Val Task) Export
	
	SetPrivilegedMode(True);
	Return JobQueue.GetJobs(New Structure("ID", Task))[0];
	
EndFunction

// It performs the queue job searching by the
// identifier (probably, saved in the infobase data).
//
// Parameters: Identifier - UUID
//
// Return value: CatalogRef.JobQueueDataAreas, ScheduledJob.
//
Function FindJob(Val ID) Export
	
	SetPrivilegedMode(True);
	
	If Not CommonUseReUse.DataSeparationEnabled() Then
		
		Task = ScheduledJobs.FindByUUID(ID);
		Return Task;
		
	Else
		
		Task = Catalogs.JobQueueDataAreas.GetRef(ID);
		If CommonUse.RefExists(Task) Then
			Return Task;
		Else
			Return Undefined;
		EndIf;
		
	EndIf;
	
EndFunction

// Deletes the scheduled job or jobs queue job.
//
// Parameters:
// Task - ScheduledJob, CatalogRef.JobQueueDataAreas.
//
Procedure DeleteJob(Val Task) Export
	
	SetPrivilegedMode(True);
	
	If TypeOf(Task) = Type("ScheduledJob") Then
		Task.Delete();
	ElsIf TypeOf(Task) = Type("CatalogRef.JobQueueDataAreas") Then
		JobQueue.DeleteJob(Task);
	EndIf;
	
EndProcedure
